[
  {
    "title": "The Division 2 Review",
    "author": "Jake Tucker",
    "shortName": "the-division-2",
    "image": "https://ksassets.timeincuk.net/wp/uploads/sites/54/2019/03/The-Division-2-6-920x518.png",
    "timestamp": 20190328,
    "content": [
      "It’s the little moments that really make The Division 2 pop for me.",
      "Sure, all the joy of cover-based combat is present and correct, pulling off killer flanks is compelling, and the palpable squee of excitement as a new gun drops and it’s just perfect for your loadout.",
      "Instead, I’m talking about the moments of quality that mark this out as a series contender for the best loot and shoot blaster on the market, despite a series of niggling flaws. You’ll encounter moments of beauty as you stomp through the overgrown Washington D.C., or moments so well designed you almost forget you’re in an online multiplayer RPG.",
      "For a certain type of player, i.e. fans of tactical shooters, or anyone after a more grounded feel than is offered up by stablemates Destiny and Anthem, The Division 2 also offers a solid, and mostly plausible, contemporary setting to run around in. This is paired up with cover-based combat that is frequently challenging but offers several rewarding ways to engage with enemies."
    ]
  },
  {
    "title": "Tropico 6 Review",
    "author": "TJ Haufer",
    "shortName": "tropico-6",
    "timestamp": 20190328,
    "image": "https://assets1.ignimgs.com/2018/09/28/tropico-6---scr-18-1538162717439_640w.png",
    "content": [
      "There aren't a lot of city builders that let you roleplay a specific type of leader, so I immediately took a liking to the freedom Tropico 6 gives you to do just that. There's nothing stopping you from trying to build a communist paradise where everyone lives in haciendas and banana pickers make as much money as tech executives, or a brutal military dictatorship that only cares about how efficiently human lives can be turned into profitable exports. Nothing, that is, besides an unwieldy economic simulation that can quickly go belly up without giving you easy access to information on how to fix it.",
      "There's a lot going on across the inviting white sand beaches, bungalows, and lush jungle interiors of the latest version of Tropico, which look great except for the waterfalls, which seem lifted out of a 10-year-old game. Despite its relaxing environment, its politicking, trade, and mission systems kept me busier than any of its predecessors as I strived to stay in power and accomplish objectives that would advance me from the colonial era all the way up to the modern day – many of my own making in sandbox mode, as well as pre-made ones in its 15 story missions.",
      "Usually, I didn't have a problem with how much was going on because the tools provided are pretty good. Laying roads, building houses, creating jobs, and ensuring access to public services is relatively easy to do, other than the fact that you can't zoom in or out when placing a building and some of the logic the road painter uses to get everything to snap together does not seem to resemble our Earth logic. Only the Colonial Era has a time limit, as you have to declare independence before your governorship runs out. But the other eras let you stay in them as long as you want, and new mechanics are introduced gradually as you go from one to the next."
    ]
  },
  {
    "title": "Assassin's Creed 3 Remastered Review",
    "author": "Seth G. Macy",
    "shortName": "assassins-creed-3-remastered",
    "timestamp": 20190329,
    "image": "https://ip.trueachievements.com/remote/download.xbox.com/content/images/66acd000-77fe-1000-9115-d802555308ae/1033/screenlg3.jpg?width=900",
    "content": [
      "A lot has happened to the Assassin’s Creed series in the seven years since Assassin's Creed 3 first came out. It was quickly overshadowed in 2013 by the follow-up, Assassin's Creed IV: Black Flag, which remains one of my all-time favorites – but that’s in part because of how well AC4 built upon the naval combat concepts introduced by its Colonial predecessor. Since then, our expectations for the series have been changed yet again by the RPG-influenced Assassin’s Creed Origins and Odyssey, which revamped combat control in a way that’s hard to go back from. So while I'm glad to say Assassin's Creed 3 Remastered does do a great job bringing the appearance of this 18th-century world and its characters of this 2012 game up to 2019 standards, there's a lot of creakiness to it that even the gameplay tweaks it makes can’t entirely smooth out.",
      "The whole package includes all the DLC (including the Tyranny of King George trilogy about an evil George Washington), as well as Assassin’s Creed 3: Liberation HD (originally for the Vita) and extra behind-the-scenes content. It’s a nice touch by Ubisoft that everyone who bought the season pass for the excellent Assassin's Creed Odyssey gets AC3 Remastered for free.",
      "The first and most obvious upgrade comes by way of the graphics. Assassin's Creed 3 and Liberation are both available in 4K, provided you have an Xbox One X or PS4 Pro, though only at 30fps. On PC, with an EVGA GeForce GTX 1080 8GB FTW and Intel i7-7700K CPU, I was able to crank all the settings to Ultra and run in 1440p at a steady 60fps (where it appears Ubisoft has locked it), and wow: What a difference it makes.",
      "Everything that’s not alive in Assassin's Creed 3 now looks incredibly realistic (except for corpses, I suppose, which occasionally rag doll hilariously). The brick buildings and cobblestone streets of Boston are absolutely amazing in their new fidelity. Wooden shingles on the roofs of houses and other landmarks in the cities look like they were individually hewn from cedar and the bricks making up much of the city look fantastic."
    ]
  },
  {
    "title": "Apex Legends Review",
    "author": "Steven Petite",
    "shortName": "apex-legends",
    "image": "https://images.mein-mmo.de/magazin/medien/2019/02/apex-legends-screenshots11-Kopie.jpg",
    "timestamp": 20190411,
    "content": [
      "Apex Legends is something of a zeitgeist stew, checking all of the boxes of recent trends all the way down to its grandiose but nondescript title. It’s one part by-the-numbers battle royale, complete with the descent from the sky, emphasis on scavenging for loot, and shrinking playable area. It’s another part hero shooter, featuring eight characters called Legends with unique ability sets built for steadfast teamwork. It comes decked out with all the modern free-to-play, games-as-service fixings, including weapon skins, emotes, seasons stretching throughout the rest of the year and (hopefully) years to come, and even the much-maligned loot boxes. None of those borrowed ideas scream originality on their own, but here they come together as something totally new thanks to a roster of personable Legends, a single lavishly designed map, and a smart approach to its mandatory three-person squads. Add great gunplay, a groundbreaking communication system, and a degree of polish that’s all but unheard of in this genre, and Apex Legends has burst onto the scene as one of the most refined and entertaining battle royale games I’ve played.",
      "Set in the Titanfall universe (but conspicuously lacking the signature Titans, falling or otherwise,) a match of Apex Legends is relatively small scale: 20 teams of three compete in a last-team-standing competition on a gradually shrinking, sci-fi-infused map. At first, I was worried about the mandatory squad-based setup, given my less-than-great experiences playing with randoms in other battle royale games. So far, however, I’ve been pleasantly surprised, in large part because of excellent non-verbal communication.",
      "While it certainly helps to talk to your teammates with a mic, Apex Legends has an intuitive contextual ping system that’s better than every other battle royales. With the tap of a button you can call out points of interest, whether that be supplies, enemy locations, or just a spot you think the team should go towards, and your character will verbally acknowledge the pings by intelligently translating what you wanted to say to your team. It’ll even offer up other bits of dialogue automatically, such as when shots are fired. I’m genuinely amazed at how advanced this incredibly simple-to-use system feels. I’ve marked unassuming enemies closing in on our location and watched as my teammates converged on their location from different angles, flanking them without so much as a single word spoken. Likewise, while your search for loot may be turning up nothing but measly pistols and loads of attachments you can’t use, one of your teammates might find and mark a useful SMG for you to grab.",
      "In my 20-or-so hours of playing on PS4 over the past week, I’ve found that the vast majority of players are effectively using the ping system to coordinate with their teammates rather than going off on their own. It’s a revelation for those of us who thus far haven’t particularly cared for playing with randoms online, regardless of whether they have a mic or not."
    ]
  },
  {
    "title": "Spider-Man Review",
    "author": "Jonathan Dornbush",
    "shortName": "spiderman",
    "image": "https://image.redbull.com/rbcom/052/2018-08-07/3c2d11b5-c45e-4b87-94bf-d3d56a2fcff9/0100/0/1/spider-man-ps4-screenshot.jpg",
    "timestamp": 20180904,
    "content": [
      "At its core, Insomniac Games’ new adventure strives to make you feel like Spider-Man. And, thankfully, Marvel's Spider-Man on PS4 succeeds at nearly every swing across Manhattan’s rooftops. I was left delighted at nearly every step of its 15-hour adventure thanks to a surprisingly deep tale that mines the plights of both Spider-Man and Peter Parker to great emotional success. Underpinning that engrossing narrative is an excellent set of webswinging mechanics, which -- combined with fun gadgets and plenty of puns -- makes for thrilling action in both the massive setpieces and in the quiet, confined corridors of tense sequences. Insomniac’s first foray into the realm of Marvel superheroes is a continually exciting adventure whose open world and combat are only occasionally caught up in a web of overly familiar trappings.",
      "Swinging around feels, quite simply, spectacular. There’s a small learning curve, but after getting comfortable with the basics, it’s nearly effortless to make Spider-Man look graceful in every swing, leap, and lunge. And man does it feel good to find the right mix of jumping, crawling, web zipping, and wall running.",
      "I’ve spent hours just soaring around the skyscrapers of New York City, testing the momentum of my swings to find just the right point to gain an extra boost of speed, or leaping off the Avengers Tower to test how close to the ground I could fall, just to swing out in the nick of time. Similar to how God of War’s Leviathan Axe felt so good to throw around, Insomniac has found web-spun gold with Spider-Man’s swinging mechanic, enhancing it with additional moves like a focal point webzip that allowed me to turn any ledge, beam, or satellite tower into a jumping off point to continue my non-stop movement. Open-world traversal hasn’t been this smooth since Sunset Overdrive (which, not coincidentally, Insomniac also developed).",
      "And, happily, no aspect of New York’s architecture can really stop Spider-Man. Discovering how a powerful, but nimble, Spider-Man tackles fire escapes, both vertically and horizontally, or watching him slip through the metal grating of a water tower is endlessly entertaining. His animations are so detailed that no matter the obstacle, I got the sense that I could truly do whatever a Spider-Man could."
    ]
  }
]
