[
  {
    "title"    : "The Division 2 Review",
    "author"   : "Jake Tucker",
    "shortName": "the-division-2",
    "image"    : "https://ksassets.timeincuk.net/wp/uploads/sites/54/2019/03/The-Division-2-6-920x518.png",
    "timestamp": 1554124864436,
    "content"  : [
      "It’s the little moments that really make The Division 2 pop for me.",
      "Sure, all the joy of cover-based combat is present and correct, pulling off killer flanks is compelling, and the palpable squee of excitement as a new gun drops and it’s just perfect for your loadout.",
      "Instead, I’m talking about the moments of quality that mark this out as a series contender for the best loot and shoot blaster on the market, despite a series of niggling flaws. You’ll encounter moments of beauty as you stomp through the overgrown Washington D.C., or moments so well designed you almost forget you’re in an online multiplayer RPG.",
      "For a certain type of player, i.e. fans of tactical shooters, or anyone after a more grounded feel than is offered up by stablemates Destiny and Anthem, The Division 2 also offers a solid, and mostly plausible, contemporary setting to run around in. This is paired up with cover-based combat that is frequently challenging but offers several rewarding ways to engage with enemies."
    ]
  },
  {
    "title"    : "Tropico 6 Review",
    "author"   : "TJ Haufer",
    "shortName": "tropico-6",
    "timestamp": 1554124866884,
    "image"    : "https://assets1.ignimgs.com/2018/09/28/tropico-6---scr-18-1538162717439_640w.png",
    "content"  : [
      "There aren't a lot of city builders that let you roleplay a specific type of leader, so I immediately took a liking to the freedom Tropico 6 gives you to do just that. There's nothing stopping you from trying to build a communist paradise where everyone lives in haciendas and banana pickers make as much money as tech executives, or a brutal military dictatorship that only cares about how efficiently human lives can be turned into profitable exports. Nothing, that is, besides an unwieldy economic simulation that can quickly go belly up without giving you easy access to information on how to fix it.",
      "There's a lot going on across the inviting white sand beaches, bungalows, and lush jungle interiors of the latest version of Tropico, which look great except for the waterfalls, which seem lifted out of a 10-year-old game. Despite its relaxing environment, its politicking, trade, and mission systems kept me busier than any of its predecessors as I strived to stay in power and accomplish objectives that would advance me from the colonial era all the way up to the modern day – many of my own making in sandbox mode, as well as pre-made ones in its 15 story missions.",
      "Usually, I didn't have a problem with how much was going on because the tools provided are pretty good. Laying roads, building houses, creating jobs, and ensuring access to public services is relatively easy to do, other than the fact that you can't zoom in or out when placing a building and some of the logic the road painter uses to get everything to snap together does not seem to resemble our Earth logic. Only the Colonial Era has a time limit, as you have to declare independence before your governorship runs out. But the other eras let you stay in them as long as you want, and new mechanics are introduced gradually as you go from one to the next."
    ]
  },
  {
    "title"    : "Assassin's Creed 3 Remastered Review",
    "author"   : "Seth G. Macy",
    "shortName": "assassins-creed-3-remastered",
    "timestamp": 1554124867436,
    "image"    : "https://ip.trueachievements.com/remote/download.xbox.com/content/images/66acd000-77fe-1000-9115-d802555308ae/1033/screenlg3.jpg?width=900",
    "content"  : [
      "A lot has happened to the Assassin’s Creed series in the seven years since Assassin's Creed 3 first came out. It was quickly overshadowed in 2013 by the follow-up, Assassin's Creed IV: Black Flag, which remains one of my all-time favorites – but that’s in part because of how well AC4 built upon the naval combat concepts introduced by its Colonial predecessor. Since then, our expectations for the series have been changed yet again by the RPG-influenced Assassin’s Creed Origins and Odyssey, which revamped combat control in a way that’s hard to go back from. So while I'm glad to say Assassin's Creed 3 Remastered does do a great job bringing the appearance of this 18th-century world and its characters of this 2012 game up to 2019 standards, there's a lot of creakiness to it that even the gameplay tweaks it makes can’t entirely smooth out.",
      "The whole package includes all the DLC (including the Tyranny of King George trilogy about an evil George Washington), as well as Assassin’s Creed 3: Liberation HD (originally for the Vita) and extra behind-the-scenes content. It’s a nice touch by Ubisoft that everyone who bought the season pass for the excellent Assassin's Creed Odyssey gets AC3 Remastered for free.",
      "The first and most obvious upgrade comes by way of the graphics. Assassin's Creed 3 and Liberation are both available in 4K, provided you have an Xbox One X or PS4 Pro, though only at 30fps. On PC, with an EVGA GeForce GTX 1080 8GB FTW and Intel i7-7700K CPU, I was able to crank all the settings to Ultra and run in 1440p at a steady 60fps (where it appears Ubisoft has locked it), and wow: What a difference it makes.",
      "Everything that’s not alive in Assassin's Creed 3 now looks incredibly realistic (except for corpses, I suppose, which occasionally rag doll hilariously). The brick buildings and cobblestone streets of Boston are absolutely amazing in their new fidelity. Wooden shingles on the roofs of houses and other landmarks in the cities look like they were individually hewn from cedar and the bricks making up much of the city look fantastic."
    ]
  }
]